src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonForms/ФормаПроверкиСтатусовГотовностиТСПИоТМДЛП/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВерсияБПОПоддерживаетРаботуСПИоТ = КонтрольКодовМаркировкиМДЛПКлиентСерверПовтИсп.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ();
	
	Если ЗначениеЗаполнено(Параметры.ПодключаемоеОборудование) Тогда
		
		ПодключаемоеОборудованиеККТ                      = Параметры.ПодключаемоеОборудование;
		Элементы.ОтборПодключаемоеОборудование.Видимость = Ложь;
		Элементы.ПодключаемоеОборудование.Видимость      = Истина;
		Элементы.ФормаОбновить.Видимость                 = Ложь;
		Элементы.НадписьЛМЧЗНеНастроенПоККТ.Видимость    = Истина;
		Элементы.НадписьЛМЧЗНеНастроен.Видимость         = Ложь;
		
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		
		ПолучитьДанныеПоПодключаемомуОборудованию();
		ЗакрытьФормуПослеПроверки = Истина;
		
	Иначе
		
		Элементы.ОтборПодключаемоеОборудование.Видимость = Истина;
		Элементы.ПодключаемоеОборудование.Видимость      = Ложь;
		Элементы.ФормаОбновить.Видимость                 = Истина;
		Элементы.НадписьЛМЧЗНеНастроенПоККТ.Видимость    = Ложь;
		Элементы.НадписьЛМЧЗНеНастроен.Видимость         = Истина;
		
		ЗакрытьФормуПослеПроверки = Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(Параметры.ДанныеСтатусаТСПИоТ) = Тип("Структура") Тогда
		
		КонструкторДанных = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
		ЗаполнитьЗначенияСвойств(КонструкторДанных, Параметры.ДанныеСтатусаТСПИоТ);
		
		ЗаполнитьДанныеСтатусаТСПИоТ(КонструкторДанных);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьСостоянийТСПИоТ();
	
	КонструкторДанных = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
	ЗаполнитьЗначенияСвойств(КонструкторДанных, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПодключаемоеОборудованиеККТ)
		И ВерсияБПОПоддерживаетРаботуСПИоТ
		И НастроенВнутреннийТСПИоТ
		И Не ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(КонструкторДанных) Тогда
		
		ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьЛМЧЗНеНастроенОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПодключитьЛокальныйМодуль" Тогда
		
		СтруктураЗаполнения = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
		Отбор               = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
		
		ПослеЗакрытияФормыНастройкиПодключения = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля", ЭтотОбъект);
		
		ОткрытьФормуЗаписиРегистраСведенийПоОтбору(
			Отбор,
			СтруктураЗаполнения,
			"НастройкиПодключенияЛокальныхМодулейМДЛП",
			ЭтотОбъект,
			,,
			ПослеЗакрытияФормыНастройкиПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДействуетАварийныйРежимОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СрокДействияАварийногоРежима" Тогда
		
		ПослеЗакрытияФормы   = Новый ОписаниеОповещения("ПослеОбработкиФормыУточненияАварийногоРежима", ЭтотОбъект);
		
		ОткрытьФорму("ОбщаяФорма.АварийныйРежимМДЛП",
			Новый Структура("АварийныйРежимВключен, АварийныйРежимДо", Истина, МестноеВремя(АварийныйРежимДо)),
			,,,,
			ПослеЗакрытияФормы,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусТСПИоТНеГотовОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьПолноеОписаниеОшибкиПодключения" Тогда
		
		ПослеПросмотраТекстаОбщейОшибки = Новый ОписаниеОповещения("ПослеПросмотраТекстаОбщейОшибки", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(ПослеПросмотраТекстаОбщейОшибки, ТекстОбщейОшибки, НСтр("ru = 'Описание ошибки'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодключаемоеОборудованиеПриИзменении(Элемент)
	
	ПолучитьДанныеПоПодключаемомуОборудованию();
	
	КонструкторДанных = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
	ЗаполнитьЗначенияСвойств(КонструкторДанных, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПодключаемоеОборудованиеККТ)
		И ВерсияБПОПоддерживаетРаботуСПИоТ
		И НастроенВнутреннийТСПИоТ
		И Не ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(КонструкторДанных) Тогда
		
		ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	КонструкторДанных = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
	ЗаполнитьЗначенияСвойств(КонструкторДанных, ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ПодключаемоеОборудованиеККТ) 
		И ВерсияБПОПоддерживаетРаботуСПИоТ
		И НастроенВнутреннийТСПИоТ
		И Не ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(КонструкторДанных) Тогда
		
		ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьСостоянийТСПИоТ()
	
	Элементы.СтраницыАвторизацияПройдена.ТекущаяСтраница = ?(АвторизацияПройдена, Элементы.СтраницаАвторизацияПройдена, Элементы.СтраницаАвторизацияНеПройдена);
	Элементы.СтраницыРегистрацияПройдена.ТекущаяСтраница = ?(РегистрацияПройдена, Элементы.СтраницаРегистрацияПройдена, Элементы.СтраницаРегистрацияНеПройдена);
	Элементы.СтраницыГотовКПроверкеКМ.ТекущаяСтраница    = ?(ГотовКПроверкеКМ, Элементы.СтраницаГотовКПроверкеКМ, Элементы.СтраницаНеГотовКПроверкеКМ);
	
	Если Не ЛМЧЗПодключен Тогда
		Элементы.СтраницыПодключениеЛМЧЗ.ТекущаяСтраница = Элементы.СтраницаЛМЧЗНеПодключен;
	ИначеЕсли ЛМЧЗГотов Тогда
		Элементы.СтраницыПодключениеЛМЧЗ.ТекущаяСтраница = Элементы.СтраницаЛМЧЗГотов;
	Иначе
		Элементы.СтраницыПодключениеЛМЧЗ.ТекущаяСтраница = Элементы.СтраницаЛМЧЗНеГотов;
	КонецЕсли;
	
	Если АварийныйРежим Тогда
		
		СрокДействияАварийногоРежимаСтрокой = СтрШаблон(НСтр("ru = 'до %1'"), Формат(АварийныйРежимДо, "ДФ=dd.MM.yyyy;"));
		
		МассивСтрокДействиеАварийногоРежима = Новый Массив;
		МассивСтрокДействиеАварийногоРежима.Добавить(НСтр("ru = 'Включен аварийный режим. Действует'"));
		МассивСтрокДействиеАварийногоРежима.Добавить(" ");
		МассивСтрокДействиеАварийногоРежима.Добавить(Новый ФорматированнаяСтрока(СрокДействияАварийногоРежимаСтрокой,,,, "СрокДействияАварийногоРежима"));
		
		ТекстНадписьДействуетАварийныйРежим = Новый ФорматированнаяСтрока(МассивСтрокДействиеАварийногоРежима);
		
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаДействуетАварийныйРежим;
		Элементы.НадписьДействуетАварийныйРежим.Заголовок = ТекстНадписьДействуетАварийныйРежим;
		
	ИначеЕсли ГотовКПроверкеКМ Тогда
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаСтатусТСПИоТУспешен;
	ИначеЕсли ПостАварийныйРежим Тогда
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаДействуетПостАварийныйРежим;
	ИначеЕсли ЗначениеЗаполнено(ТекстОбщейОшибки) Тогда
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаСтатусТСПИоТНеУспешен;
	ИначеЕсли Не НастроенВнутреннийТСПИоТ Тогда
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаНеНайденТСПИоТ;
	Иначе
		Элементы.СтраницыСтатусТСПИоТ.ТекущаяСтраница = Элементы.СтраницаСтатусТСПИоТИдетНастройка;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтатусаТСПИоТ(КонструкторДанных)
	
	АварийныйРежим          = КонструкторДанных.АварийныйРежим;
	АварийныйРежимДо        = КонструкторДанных.АварийныйРежимДо;
	АвторизацияПройдена     = КонструкторДанных.АвторизацияПройдена;
	ГотовКПроверкеКМ        = КонструкторДанных.ГотовКПроверкеКМ;
	ГотовКПроверкеКМOnline  = КонструкторДанных.ГотовКПроверкеКМOnline;
	ГотовКПроверкеКМOffline = КонструкторДанных.ГотовКПроверкеКМOffline;
	ЛМЧЗГотов               = КонструкторДанных.ЛМЧЗГотов;
	ЛМЧЗСтатус              = КонструкторДанных.ЛМЧЗСтатус;
	ПостАварийныйРежим      = КонструкторДанных.ПостАварийныйРежим;
	РегистрацияПройдена     = КонструкторДанных.РегистрацияПройдена;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеЛокальногоМодуля()
	
	НастройкаЛМЧЗ = РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто);
	ЛМЧЗПодключен = НастройкаЛМЧЗ.НастроеноПодключение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтатусаГотовностиТСПИоТ() Экспорт
	
	ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	
	МодульМенеджерОборудованияКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("МенеджерОборудованияКлиентСервер");
	ДополнительныеПараметры = МодульМенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПоддержкаОборудования.ПодключаемоеОборудование.ЧекопечатающиеУстройства") Тогда
		
		МодульОборудованиеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеКлиент.НачатьПолучениеСтатусаПИоТ(
			ОповещениеПослеВыполнения,
			УникальныйИдентификатор,
			ПодключаемоеОборудованиеККТ,,
			ДополнительныеПараметры);
		
	Иначе
		
		Результат = Новый Структура;
		Результат.Вставить("Результат"     , Ложь);
		Результат.Вставить("ОписаниеОшибки", "");
		
		Результат.ОписаниеОшибки = НСтр("ru = 'Невозможно начать получение статуса внутреннего ТС ПИоТ по причине:'");
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + Символы.ПС + НСтр("ru = 'Не внедрена подсистема БПО Чекопечатающие устройства.'");
		
		ВыполнитьОбработкуОповещения(ОповещениеПослеВыполнения, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСтатусаГотовностиТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат.Результат Тогда
		// ошибка при подключении компоненты, ошибка при проверке
		
		ТекстОбщейОшибки = Результат.ОписаниеОшибки;
		УстановитьВидимостьСостоянийТСПИоТ();
		
	ИначеЕсли Результат.Свойство("СтатусСостояния") Тогда
		
		КонструкторДанных = ИнтеграцияТСПИоТМДЛПКлиентСервер.КонструкторДаныхСтатусаТСПИоТ();
		ЗаполнитьЗначенияСвойств(КонструкторДанных, Результат.СтатусСостояния);
		
		ЗаполнитьДанныеСтатусаТСПИоТ(КонструкторДанных);
		УстановитьВидимостьСостоянийТСПИоТ();
		
		Если Не ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(КонструкторДанных) Тогда
			ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 0.5, Истина);
		ИначеЕсли ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверкаГотовностиТСПИоТаКПроверкеКМ(КонструкторДанных) Тогда
			ПодключитьОбработчикОжидания("ЗакрытьПослеПереходаВСтатусГотовностиПроверкиТСПИоТ", 0.1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	ПроверитьПодключениеЛокальногоМодуля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОбработкиФормыУточненияАварийногоРежима(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АктивностьРежима") Тогда
		
		Если Результат.АктивностьРежима Тогда
			// включение аварийного режима
			РазрешительныйРежимМДЛПВызовСервера.ВключитьАварийныйРежимРазрешительнойСистемы(Результат.СрокДействияВЧасах);
			
		Иначе
			// отключение аварийного режима
			РазрешительныйРежимМДЛПВызовСервера.ОтключитьАварийныйРежимРазрешительнойСистемы();
			
		КонецЕсли;
		
		ПараметрыАварийногоРежима = СобытияФормРазрешительныйРежимМДЛПКлиент.ДанныеНастройкиАварийногоРежима();
		
		АварийныйРежим   = ПараметрыАварийногоРежима.Включено;
		АварийныйРежимДо = ПараметрыАварийногоРежима.ДатаОкончания;
		
		УстановитьВидимостьСостоянийТСПИоТ();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПросмотраТекстаОбщейОшибки(Результат, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПослеПереходаВСтатусГотовностиПроверкиТСПИоТ() Экспорт
	
	Если Не ЗакрытьФормуПослеПроверки Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоПодключаемомуОборудованию()
	
	СтруктураРеквизитовПодключаемогоОборудования = ОбщегоНазначенияБПО.ЗначенияРеквизитовОбъекта(ПодключаемоеОборудованиеККТ, "Организация, РабочееМесто");
	
	Организация = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(СтруктураРеквизитовПодключаемогоОборудования.Организация);
	РабочееМесто = СтруктураРеквизитовПодключаемогоОборудования.РабочееМесто;
	
	ПроверитьПодключениеЛокальногоМодуля();
	
	Если Не ВерсияБПОПоддерживаетРаботуСПИоТ Тогда
		Возврат;
	КонецЕсли;
	
	МодульОборудование = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияТСПИоТ");
	НастроенВнутреннийТСПИоТ = ЗначениеЗаполнено(МодульОборудование.ПолучитьТСПИоТ(ПодключаемоеОборудованиеККТ));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаписиРегистраСведенийПоОтбору(
		Отбор,
		ЗначенияЗаполнения,
		Знач ИмяРегистра,
		ФормаВладелец,
		Знач ИмяФормы = "",
		ПараметрыФормы = Неопределено,
		ОповещениеОЗакрытии = Неопределено)
	
	Перем КлючЗаписи;
	
	НаборЗаписейПустой = НаборЗаписейРегистраПустой(Отбор, ИмяРегистра);
	
	Если Не НаборЗаписейПустой Тогда
		// Создаем через тип, так как находимся на клиенте.
		
		ТипЗначения = Тип("РегистрСведенийКлючЗаписи." + ИмяРегистра);
		Параметры = Новый Массив(1);
		Параметры[0] = Отбор;
		
		КлючЗаписи = Новый(ТипЗначения, Параметры);
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Ключ",               КлючЗаписи);
	ПараметрыЗаписи.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Если ПараметрыФормы <> Неопределено Тогда
		
		Для Каждого Элемент Из ПараметрыФормы Цикл
			
			ПараметрыЗаписи.Вставить(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяФормы) Тогда
		
		ПолноеИмяФормы = "РегистрСведений.[ИмяРегистра].ФормаЗаписи";
		ПолноеИмяФормы = СтрЗаменить(ПолноеИмяФормы, "[ИмяРегистра]", ИмяРегистра);
		
	Иначе
		
		ПолноеИмяФормы = "РегистрСведений.[ИмяРегистра].Форма.[ИмяФормы]";
		ПолноеИмяФормы = СтрЗаменить(ПолноеИмяФормы, "[ИмяРегистра]", ИмяРегистра);
		ПолноеИмяФормы = СтрЗаменить(ПолноеИмяФормы, "[ИмяФормы]", ИмяФормы);
		
	КонецЕсли;
	
	// открываем форму записи РС
	Если ОповещениеОЗакрытии <> Неопределено Тогда
		ОткрытьФорму(ПолноеИмяФормы, ПараметрыЗаписи, ФормаВладелец, , , , ОповещениеОЗакрытии);
	Иначе
		ОткрытьФорму(ПолноеИмяФормы, ПараметрыЗаписи, ФормаВладелец);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НаборЗаписейРегистраПустой(СтруктураЗаписи, ИмяРегистра)
	
	// Создаем набор записей регистра.
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей(); // РегистрСведенийНаборЗаписей
	
	Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
		ЗначениеОтбора = Неопределено;
		Если СтруктураЗаписи.Свойство(ЭлементОтбора.Имя, ЗначениеОтбора) Тогда
			ЭлементОтбора.Установить(ЗначениеОтбора);
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	
	Возврат НаборЗаписей.Количество() = 0;
	
КонецФункции

#КонецОбласти
